{
  "categories": [
    {
      "title": "Guide d'Utilisation Détaillé",
      "cards": [
        {
          "id": "calculateur",
          "title": "Le Calculateur : Saisie et Suivi",
          "icon": "fa-solid fa-calculator",
          "summary": "La page principale pour saisir vos comptages, gérer tous les types de paiements et voir les résultats en direct.",
          "link": "/calculateur",
          "tags": ["Saisie", "Temps Réel", "Espèces", "CB", "Chèques"],
          "content": "<h4>Le Cœur de l'Opération</h4><p>Le calculateur est l'écran où vous passerez le plus de temps. Chaque aspect a été pensé pour rendre la saisie des comptages rapide, précise et collaborative.</p><h5>Structure de la Page</h5><ul><li><strong>Navigation par Caisse :</strong> Si plusieurs caisses sont configurées, chacune possède son propre onglet principal en haut de la page. Cliquez sur un onglet pour afficher le formulaire de la caisse correspondante.</li><li><strong>Saisie par Mode de Paiement :</strong> À l'intérieur de chaque caisse, des sous-onglets permettent de séparer clairement la saisie pour <strong><i class='fa-solid fa-money-bill-wave'></i> Espèces</strong>, <strong><i class='fa-solid fa-credit-card'></i> Carte Bancaire</strong> et <strong><i class='fa-solid fa-money-check-dollar'></i> Chèques</strong>. Cela évite les erreurs et simplifie grandement le processus de comptage.</li><li><strong>Champs Théoriques :</strong> Pour chaque mode de paiement, vous trouverez des champs pour les montants 'théoriques' (par exemple, 'Encaissement Espèces Théorique'). Ce sont les montants attendus, souvent issus de votre logiciel de vente. La comparaison entre ces montants et ce que vous comptez physiquement génère l'écart.</li></ul><h5>Fonctionnalités Clés</h5><ul><li><strong>Indicateur d'Écart Dynamique :</strong> Un bandeau flottant en haut de la page affiche l'écart en temps réel pour l'onglet de paiement actif (Espèces, CB ou Chèques). Il change de couleur pour une identification immédiate : <ul><li><strong style='color:var(--color-success);'>Vert :</strong> Écart nul, votre caisse est juste.</li><li><strong style='color:var(--color-warning);'>Orange :</strong> Écart positif, vous avez plus que prévu.</li><li><strong style='color:var(--color-danger);'>Rouge :</strong> Écart négatif, il manque de l'argent.</li></ul></li><li><strong>Sauvegarde Automatique :</strong> L'application sauvegarde automatiquement votre travail en arrière-plan quelques secondes après une modification. Un statut 'Changements sauvegardés' ou 'Sauvegarde en cours...' s'affiche en bas de page. Si vous fermez accidentellement votre navigateur, les dernières données saisies seront rechargées à votre retour.</li></ul><div class='info-box tip'><div class='info-box-header'><i class='fa-solid fa-keyboard'></i>Astuce Pro</div><p>Pour une saisie ultra-rapide des pièces et billets, utilisez la touche 'Entrée' de votre clavier. Après avoir saisi une quantité, appuyez sur 'Entrée' pour passer automatiquement au champ suivant sans utiliser la souris.</p></div><div class='info-box warning'><div class='info-box-header'><i class='fa-solid fa-triangle-exclamation'></i>Rétrocessions</div><p>Le champ 'Rétrocessions en Espèces' est destiné aux sorties d'argent manuelles du tiroir-caisse (par exemple, pour payer un fournisseur). Ce montant s'ajoute à vos ventes espèces théoriques pour calculer l'écart final.</p></div>"
        },
        {
          "id": "historique",
          "title": "L'Historique : Analyse et Gestion",
          "icon": "fa-solid fa-history",
          "summary": "Consultez, filtrez, analysez en détail et exportez tous vos comptages enregistrés.",
          "link": "/historique",
          "tags": ["Rapport", "Analyse", "Export", "Détails"],
          "content": "<h4>Votre Mémoire Financière</h4><p>La page d'historique vous donne un accès complet et détaillé à tous les comptages précédemment enregistrés. C'est un outil puissant pour l'analyse et la gestion.</p><h5>Fonctionnalités Principales</h5><ul><li><strong>Vue d'Ensemble :</strong> Les comptages sont présentés sous forme de cartes claires, affichant le nom, la date et l'écart global. La bordure de couleur de chaque carte (verte, orange, rouge) vous indique immédiatement l'état de l'écart.</li><li><strong>Filtres et Recherche :</strong> Utilisez les filtres par date ou la barre de recherche par nom pour retrouver rapidement un comptage spécifique parmi des centaines d'enregistrements.</li><li><strong>Actions sur un Comptage :</strong> Chaque carte propose des actions directes :<ul><li><strong><i class='fa-solid fa-eye'></i> Détails :</strong> Ouvre un panneau inférieur contenant une vue complète et détaillée du comptage. Ce panneau inclut des graphiques de répartition par mode de paiement, la liste de toutes les dénominations, les chèques et les relevés de TPE. Il est également possible d'imprimer ce résumé pour vos archives papier.</li><li><strong><i class='fa-solid fa-download'></i> Charger :</strong> Reprend un ancien comptage et l'charge dans le calculateur. Ceci est très utile pour corriger une erreur a posteriori ou pour repartir d'une base existante. <strong>Attention, cela écrase les données non sauvegardées actuellement dans le calculateur.</strong></li><li><strong><i class='fa-solid fa-trash-can'></i> Supprimer :</strong> Efface définitivement un comptage de la base de données après confirmation.</li></ul></li><li><strong>Synthèse des Retraits :</strong> Un onglet dédié vous permet d'analyser le total des retraits d'espèces effectués par jour sur une période donnée. Vous pouvez cliquer sur une journée pour voir le détail des coupures retirées de chaque caisse.</li><li><strong>Export CSV :</strong> Le bouton d'export vous permet de télécharger un fichier CSV (compatible avec Excel et autres tableurs) de la sélection de comptages actuellement affichée (filtrée ou non) pour une analyse plus poussée.</li></ul>"
        },
        {
          "id": "reserve",
          "title": "La Réserve : Gestion de la Monnaie",
          "icon": "fa-solid fa-vault",
          "summary": "Gérez le stock central de monnaie, traitez les demandes des caisses et suivez tous les mouvements de fonds.",
          "link": "/reserve",
          "tags": ["Gestion", "Stock", "Trésorerie"],
          "content": "<h4>Gestion Centralisée de la Trésorerie</h4><p>Cette page est un mini-système de gestion de trésorerie interne. Elle permet de gérer le stock central de monnaie (la 'réserve') et de tracer les échanges avec les différentes caisses, assurant que vous ayez toujours assez de change.</p><h5>Le Flux de Travail</h5><ol><li><strong><i class='fa-solid fa-file-invoice-dollar'></i> Créer une Demande :</strong> Un opérateur sur une caisse manque de monnaie (par exemple, de pièces de 1€). Il clique sur 'Nouvelle Demande', sélectionne sa caisse, la dénomination dont il a besoin (ex: p100 pour 1€) et la quantité. Cette demande apparaît alors dans la liste des 'Demandes en attente'.</li><li><strong><i class='fa-solid fa-right-left'></i> Traiter la Demande :</strong> Un administrateur voit la demande en attente. Il clique sur 'Traiter'. Une fenêtre s'ouvre, lui demandant de réaliser un échange équilibré :<ul><li><strong>Donner à la caisse :</strong> Il prépare la monnaie demandée (par ex. 50 pièces de 1€, soit 50€).</li><li><strong>Reprendre de la caisse :</strong> Pour garder la comptabilité juste, il doit reprendre une valeur équivalente de la caisse (par ex. 1 billet de 50€).</li></ul>L'échange ne peut être validé que si la balance est exactement de zéro.</li><li><strong><i class='fa-solid fa-timeline'></i> Suivre l'Historique :</strong> Chaque échange validé est consigné dans l'historique des 'Derniers Mouvements' pour une traçabilité complète.</li></ol><h5>État du Stock</h5><p>Le tableau de bord en haut de la page affiche en temps réel la quantité de chaque billet et pièce disponible dans la réserve, ainsi que la valeur totale du stock. Ce stock est mis à jour automatiquement après chaque échange traité.</p>"
        }
      ]
    },
    {
      "title": "Processus Avancés & Administration",
      "cards": [
        {
          "id": "collaboration",
          "title": "Collaboration en Temps Réel",
          "icon": "fa-solid fa-wifi",
          "summary": "Travaillez à plusieurs sur le même comptage et voyez les modifications des autres utilisateurs instantanément.",
          "link": null,
          "tags": ["Temps Réel", "Multi-utilisateur", "WebSocket"],
          "content": "<h4>Ne vous marchez plus sur les pieds</h4><p>Grâce à une technologie appelée <strong>WebSocket</strong>, l'application maintient une connexion permanente avec le serveur. Quand un utilisateur modifie un champ dans le calculateur, cette information est envoyée au serveur, qui la diffuse instantanément à tous les autres utilisateurs connectés sur la même page. Vous voyez ainsi les chiffres, les chèques ajoutés ou les relevés de TPE changer en direct sur votre écran.</p><div class='info-box tip'><div class='info-box-header'><i class='fa-solid fa-circle-check'></i>Indicateur de Connexion</div><p>Pour que la collaboration fonctionne, le service WebSocket doit être actif sur le serveur. Un indicateur dans la barre de navigation vous informe de son état : la pastille est <strong>verte</strong> si vous êtes connecté, et <strong>rouge</strong> si la connexion est perdue. Si elle est rouge, la collaboration et certaines fonctionnalités comme la clôture sont désactivées.</p></div><p>Cette fonctionnalité est idéale lorsque plusieurs personnes doivent compter le contenu d'une même caisse ou se répartir le comptage de plusieurs caisses en même temps. Elle évite la double saisie et les erreurs.</p>"
        },
        {
          "id": "cloture",
          "title": "L'Assistant de Clôture de Journée",
          "icon": "fa-solid fa-lock",
          "summary": "Un processus guidé et sécurisé pour finaliser les comptages, calculer les retraits et préparer le jour suivant.",
          "link": null,
          "tags": ["Clôture", "Processus", "Sécurité"],
          "content": "<h4>Un processus guidé pour éviter les erreurs</h4><p>Le bouton 'Clôture' dans la barre de navigation est une fonctionnalité cruciale. Il lance un assistant qui vous guide pas à pas pour finaliser la journée de manière propre, sécurisée et traçable.</p><h5>Les 4 Étapes de l'Assistant :</h5><ol><li><strong><i class='fa-solid fa-check-square'></i> Sélection :</strong> Vous choisissez les caisses que vous souhaitez clôturer. L'application vous indique en temps réel quelles caisses sont déjà clôturées ou en cours d'utilisation par un autre collaborateur (celles-ci sont grisées et non sélectionnables).</li><li><strong><i class='fa-solid fa-calculator'></i> Comptage :</strong> L'assistant récupère les données que vous venez de saisir dans le calculateur. C'est votre dernière chance de vérifier et d'ajuster tous les montants (fonds de caisse, ventes théoriques, quantités de pièces/billets, chèques, TPE).</li><li><strong><i class='fa-solid fa-download'></i> Synthèse & Retraits :</strong> C'est l'étape la plus intelligente. L'application analyse le contenu de chaque caisse sélectionnée et, en se basant sur la recette en espèces du jour, elle calcule automatiquement la combinaison optimale de billets et de pièces à retirer de chaque tiroir-caisse. Le but est de laisser uniquement le fond de caisse cible pour le lendemain.</li><li><strong><i class='fa-solid fa-flag-checkered'></i> Finalisation :</strong> Un résumé complet et détaillé de toutes les opérations (ventes, comptages, écarts, retraits, fonds de caisse J+1) s'affiche. Une fois que vous cochez la case de confirmation et validez, l'application effectue plusieurs actions critiques en une seule fois :<ul><li>Un comptage final nommé 'Clôture Générale' est créé dans l'historique avec les chiffres du tableau.</li><li>Un nouveau comptage nommé 'Fond de caisse J+1' est automatiquement généré. Il servira de base pour démarrer la journée du lendemain.</li><li>L'état des caisses est réinitialisé, et tous les verrous posés par l'assistant sont levés.</li></ul></li></ol>"
        },
        {
          "id": "admin",
          "title": "Panneau d'Administration",
          "icon": "fa-solid fa-toolbox",
          "summary": "Gérez les caisses, les TPE, les utilisateurs et les paramètres financiers de l'application.",
          "link": "/admin",
          "tags": ["Admin", "Configuration", "Gestion"],
          "content": "<p>Cette section, accessible uniquement via un compte administrateur, est le centre de contrôle de l'application. Elle permet de configurer le logiciel pour qu'il corresponde parfaitement à votre environnement de travail.</p><h5>Sections de Gestion :</h5><ul><li><strong><i class='fa-solid fa-cash-register'></i> Gestion des Caisses :</strong> Créez, renommez ou supprimez des caisses. <strong>Attention :</strong> la suppression d'une caisse entraîne la suppression irréversible de toutes les données historiques qui lui sont associées.</li><li><strong><i class='fa-solid fa-credit-card'></i> Gestion des TPE :</strong> Ajoutez, renommez ou supprimez des terminaux de paiement électronique (TPE) et associez-les à une caisse spécifique pour un suivi précis des paiements par carte.</li><li><strong><i class='fa-solid fa-shield-halved'></i> Fond de Caisse Minimal :</strong> Définissez la quantité minimale de chaque billet ou pièce que vous souhaitez conserver dans les caisses après un retrait. Cela permet d'affiner les suggestions de l'assistant de clôture pour s'assurer de toujours garder assez de change.</li><li><strong><i class='fa-solid fa-users-cog'></i> Gestion des Administrateurs :</strong> Consultez la liste des utilisateurs ayant les droits d'administration. La création, modification de mot de passe et suppression des utilisateurs se font via la console sur le serveur pour des raisons de sécurité.</li></ul>"
        }
      ]
    }
  ]
}
