{
  "categories": [
    {
      "title": "Guide d'Utilisation",
      "cards": [
        {
          "id": "calculateur",
          "title": "Le Calculateur",
          "icon": "fa-solid fa-calculator",
          "summary": "La page principale pour saisir vos comptages et voir les résultats en direct.",
          "link": "/calculateur",
          "content": "<h4>Le Cœur de l'Opération</h4><p>Le calculateur est l'écran principal où s'effectue la saisie des comptages. Son interface est conçue pour être à la fois rapide et intuitive.</p><ul><li><strong>Navigation par Onglets :</strong> Chaque caisse configurée dans l'application possède son propre onglet principal. Vous pouvez basculer entre les caisses en un clic.</li><li><strong>Saisie par Mode de Paiement :</strong> À l'intérieur de chaque caisse, des sous-onglets permettent de séparer clairement la saisie pour chaque type de paiement :<ul><li><strong>Espèces :</strong> Saisissez la quantité de chaque billet et pièce. Le total de chaque ligne et l'écart en espèces sont calculés et affichés instantanément.</li><li><strong>Carte Bancaire :</strong> Gérez les relevés de chaque Terminal de Paiement Électronique (TPE) associé à la caisse. Vous pouvez ajouter plusieurs relevés (par exemple, un en milieu de journée et un à la fin) pour calculer automatiquement le total encaissé.</li><li><strong>Chèques :</strong> Ajoutez chaque chèque individuellement avec son montant et un commentaire optionnel (comme le numéro du chèque). Le total des chèques est calculé automatiquement.</li></ul></li><li><strong>Indicateur d'Écart Dynamique :</strong> Un bandeau flottant en haut de la page affiche l'écart en temps réel pour le mode de paiement que vous consultez. Il change de couleur pour une identification immédiate :<ul><li><strong style='color:#27ae60;'>Vert :</strong> L'écart est nul.</li><li><strong style='color:#f39c12;'>Orange :</strong> Il y a un excédent (plus d'argent compté que prévu).</li><li><strong style='color:#c0392b;'>Rouge :</strong> Il y a un manquant (moins d'argent compté que prévu).</li></ul></li><li><strong>Sauvegarde et Fiabilité :</strong><ul><li><strong>Sauvegarde Manuelle :</strong> Vous pouvez nommer votre comptage et y ajouter une explication avant de l'enregistrer manuellement.</li><li><strong>Sauvegarde Automatique :</strong> Pour éviter toute perte de données, l'application sauvegarde automatiquement votre travail à intervalles réguliers et lorsque vous quittez la page. Si vous fermez votre navigateur ou perdez la connexion, les dernières données saisies seront rechargées à votre retour.</li></ul></li></ul>"
        },
        {
          "id": "historique",
          "title": "L'Historique",
          "icon": "fa-solid fa-history",
          "summary": "Consultez, filtrez et exportez tous vos comptages enregistrés.",
          "link": "/historique",
          "content": "<h4>Votre Mémoire Financière</h4><p>La page d'historique vous donne un accès complet à tous les comptages précédemment enregistrés.</p><ul><li><strong>Vue d'Ensemble :</strong> Les comptages sont présentés sous forme de cartes, affichant le nom, la date et l'écart global, vous permettant d'identifier rapidement les anomalies.</li><li><strong>Filtre et Recherche :</strong> Retrouvez facilement un comptage grâce aux filtres par date et à la barre de recherche par nom.</li><li><strong>Actions sur un Comptage :</strong><ul><li><strong>Détails :</strong> Affichez une vue complète et imprimable d'un comptage, avec le détail de chaque dénomination, la liste des chèques et les relevés TPE.</li><li><strong>Charger :</strong> Reprenez un ancien comptage en le chargeant directement dans le calculateur. Cela est utile pour corriger une erreur ou repartir d'une base existante. Cette action crée une nouvelle sauvegarde automatique pour ne pas écraser l'original.</li><li><strong>Supprimer :</strong> Effacez définitivement un comptage de la base de données (action irréversible).</li><li><strong>Comparer :</strong> Sélectionnez deux ou plusieurs comptages pour afficher un tableau comparatif de leurs indicateurs clés (recette réelle, écart, etc.).</li></ul></li><li><strong>Synthèse des Retraits :</strong> Un onglet dédié vous permet de visualiser et d'analyser le total des retraits d'espèces effectués lors des clôtures, jour par jour.</li></ul>"
        },
        {
          "id": "reserve",
          "title": "La Réserve",
          "icon": "fa-solid fa-vault",
          "summary": "Gérez le stock de monnaie, traitez les demandes des caisses et suivez les mouvements.",
          "link": "/reserve",
          "content": "<h4>Gestion Centralisée de la Monnaie</h4><p>Cette page permet de gérer le stock central de monnaie et de tracer les échanges avec les différentes caisses.</p><ul><li><strong>État du Stock :</strong> Un tableau de bord affiche en temps réel la quantité de chaque billet et pièce disponible dans la réserve, ainsi que la valeur totale.</li><li><strong>Flux de Demande et Traitement :</strong><ol><li>Un utilisateur peut soumettre une 'demande de monnaie' pour une caisse spécifique (ex: besoin de 100€ en billets de 10€).</li><li>La demande apparaît dans la liste des 'Demandes en attente'.</li><li>Un administrateur peut alors la 'Traiter' : une fenêtre s'ouvre pour enregistrer précisément l'échange (ex: donner 10 billets de 10€ et reprendre 1 billet de 100€ en échange). La balance de l'échange doit être nulle pour valider.</li></ol></li><li><strong>Historique des Mouvements :</strong> Chaque échange validé est consigné dans un historique, assurant une traçabilité complète des mouvements entre la réserve et les caisses.</li></ul>"
        }
      ]
    },
    {
      "title": "Processus & Administration",
      "cards": [
        {
          "id": "collaboration",
          "title": "Collaboration en Temps Réel",
          "icon": "fa-solid fa-wifi",
          "summary": "Travaillez à plusieurs sur le même comptage et voyez les modifications instantanément.",
          "link": null,
          "content": "<h4>Comment ça marche ?</h4><p>Grâce à une technologie appelée WebSocket, l'application maintient une connexion permanente avec le serveur. Quand un utilisateur modifie un champ dans le calculateur, cette information est envoyée au serveur, qui la diffuse instantanément à tous les autres utilisateurs connectés. Leurs écrans se mettent à jour automatiquement.</p><h4>Indicateurs Visuels</h4><p>Sur le calculateur, les onglets des caisses changent de couleur pour vous indiquer si une caisse est en cours de modification par un autre utilisateur (violet) ou déjà clôturée (gris), vous évitant ainsi les conflits de saisie.</p>"
        },
        {
          "id": "cloture",
          "title": "L'Assistant de Clôture",
          "icon": "fa-solid fa-lock",
          "summary": "Découvrez l'assistant sécurisé pour finaliser les comptages de la journée.",
          "link": null,
          "content": "<h4>Un processus guidé et sécurisé</h4><p>Le bouton 'Clôture' dans la barre de navigation lance un assistant qui vous guide pas à pas pour finaliser la journée de manière sécurisée et fiable. Il a été spécialement conçu pour fonctionner dans un environnement collaboratif.</p><h4>Les étapes de l'assistant :</h4><ol><li><strong>Sélection :</strong> Vous choisissez les caisses à clôturer. L'assistant vous indique en temps réel si une caisse est déjà clôturée ou en cours d'utilisation par un autre collaborateur.</li><li><strong>Comptage :</strong> L'assistant récupère les données les plus à jour (y compris les modifications des autres utilisateurs jusqu'à la dernière seconde) et vous permet de vérifier et d'ajuster une dernière fois tous les montants.</li><li><strong>Synthèse & Retraits :</strong> L'application calcule automatiquement les montants à retirer de chaque caisse pour laisser le bon fond de caisse pour le lendemain, en se basant sur les règles que vous avez définies.</li><li><strong>Finalisation :</strong> Un résumé complet de toutes les opérations s'affiche. Une fois que vous confirmez, l'application enregistre un comptage final dans l'historique et prépare un comptage 'Fond de caisse J+1' pour démarrer la journée suivante.</li></ol><p>Ce processus garantit que les données sont exactes et que la transition vers la journée suivante se fait sans erreur.</p>"
        },
        {
          "id": "admin",
          "title": "Panneau d'Administration",
          "icon": "fa-solid fa-toolbox",
          "summary": "Gérez les caisses, les TPE, les utilisateurs et les paramètres de la réserve.",
          "link": "/admin",
          "content": "<p>Cette section, accessible via un compte sécurisé, est le centre de contrôle de l'application. Vous pouvez y effectuer les actions suivantes :</p><ul><li><strong>Gestion des Caisses :</strong> Créer, renommer ou supprimer des caisses.</li><li><strong>Gestion des TPE :</strong> Ajouter, renommer ou supprimer des terminaux de paiement et les associer à des caisses.</li><li><strong>Gestion des Administrateurs :</strong> Voir la liste des utilisateurs ayant accès à ce panneau.</li><li><strong>Mise à jour de la Réserve :</strong> Mettre à jour manuellement le stock de monnaie dans la réserve.</li></ul>"
        }
      ]
    },
    {
      "title": "Documentation Technique",
      "cards": [
        {
          "id": "architecture",
          "title": "Architecture Générale",
          "icon": "fa-solid fa-sitemap",
          "summary": "Découvrez comment l'application est structurée (SPA, API, WebSocket).",
          "link": null,
          "content": "<h4>Une Single Page Application (SPA)</h4><p>L'application est conçue comme une <strong>Single Page Application</strong>. Le navigateur charge une seule page HTML (<code>index.html</code>) et c'est ensuite JavaScript qui gère l'affichage des différentes vues (Calculateur, Historique...) sans jamais recharger la page. Cela offre une expérience utilisateur fluide et rapide.</p><ul><li><strong>Front-End :</strong> Entièrement en JavaScript natif (ES6 modules), il gère l'interface, la logique métier côté client et la communication avec les serveurs. Le fichier <code>router.js</code> est responsable de l'affichage de la bonne page en fonction de l'URL.</li><li><strong>Back-End (API) :</strong> Un serveur PHP agit comme une API RESTful. Le fichier <code>public/index.php</code> sert de point d'entrée unique (Front Controller) qui redirige les requêtes vers les bons contrôleurs (ex: <code>CalculateurController.php</code>).</li><li><strong>Serveur WebSocket :</strong> Un processus PHP indépendant (<code>config/websocket_server.php</code>), basé sur la bibliothèque Ratchet, tourne en permanence pour gérer les connexions temps réel.</li></ul>"
        },
        {
          "id": "collaboration-tech",
          "title": "Logique de Collaboration",
          "icon": "fa-solid fa-network-wired",
          "summary": "Comprenez le mécanisme de diffusion des données via le serveur WebSocket.",
          "link": null,
          "content": "<h4>Le Rôle du Serveur WebSocket</h4><p>La collaboration repose entièrement sur le serveur WebSocket. Il agit comme un 'hub' central d'information.</p><ol><li><strong>Connexion & Synchronisation :</strong> À son arrivée, un client charge l'état de la dernière sauvegarde (BDD) puis demande au serveur WebSocket l'état 'live' (<code>get_full_state</code>). Le serveur lui envoie son état actuel en mémoire, qui est la source de vérité la plus récente.</li><li><strong>Diffusion (Broadcast) :</strong> Quand un client modifie un champ, il envoie un message au serveur (ex: <code>{type: 'update', ...}</code>). Le serveur met à jour son propre état en mémoire (<code>formState</code>) puis renvoie ce message à <strong>tous les autres clients</strong>.</li><li><strong>Mise à Jour Locale :</strong> Les autres clients reçoivent le message et mettent à jour l'interface correspondante.</li></ol><p>Ce mécanisme est crucial car il est asynchrone et non-bloquant. L'état en base de données n'est mis à jour que lors des sauvegardes manuelles ou automatiques, ce qui est beaucoup moins fréquent et plus performant.</p>"
        },
        {
          "id": "cloture-tech",
          "title": "Logique de Clôture",
          "icon": "fa-solid fa-gears",
          "summary": "Plongez dans la logique de synchronisation et de verrouillage qui sécurise la clôture.",
          "link": null,
          "content": "<h4>Garantir l'Intégrité des Données</h4><p>Le processus de clôture est une opération critique qui doit être protégée contre les 'race conditions' (lorsque deux utilisateurs tentent de modifier la même ressource en même temps).</p><ul><li><strong>Synchronisation Continue :</strong> Lorsque l'assistant de clôture est lancé, il continue d'écouter les messages WebSocket. Les données du comptage sont mises à jour en arrière-plan pendant que l'utilisateur est sur l'écran de sélection.</li><li><strong>Verrouillage Atomique :</strong> Au moment précis où l'utilisateur valide sa sélection de caisses, des messages <code>cloture_lock</code> sont envoyés. Le service <code>ClotureStateService.php</code> utilise des requêtes SQL atomiques pour inscrire le verrouillage dans la table <code>cloture_status</code>. Le premier arrivé gagne, empêchant tout conflit.</li><li><strong>'Photographie' des Données :</strong> Une fois les caisses verrouillées, l'assistant cesse d'écouter les mises à jour pour ces dernières. L'étape de comptage se base sur une 'photographie' exacte des données au moment du verrouillage.</li><li><strong>Transaction Finale :</strong> La sauvegarde finale dans la base de données (clôture générale, fond de caisse J+1) est effectuée à l'intérieur d'une transaction SQL. Si une seule des opérations échoue, toutes les modifications sont annulées (rollback), garantissant que la base de données ne se retrouve jamais dans un état incohérent.</li></ul>"
        }
      ]
    }
  ]
}
